[NoCoverage] BlockStatement
engine-wrapper/src/health/health.controller.ts:22:11
 
   @Get()
   @HealthCheck()
-  check() {
-    return this.health.check([
-      async () => this.engine.checkReady('engine'),
-      // The process should not use more than 100MB memory
-      async () => this.memory.checkHeap('memory_heap', 100 * 1024 * 1024),
-      // The process should not have more than 300MB allocated
-      async () => this.memory.checkRSS('memory_rss', 300 * 1024 * 1024),
-      // The used disk storage should not exceed 70% of the full disk size
-      async () =>
-        this.disk.checkStorage('disk', { thresholdPercent: 0.70, path: '/' }),
-    ]);
-  }
+  check() {}
 }
 

[NoCoverage] ArrowFunction
engine-wrapper/src/health/health.controller.ts:24:7
   @HealthCheck()
   check() {
     return this.health.check([
-      async () => this.engine.checkReady('engine'),
+      () => undefined,
       // The process should not use more than 100MB memory
       async () => this.memory.checkHeap('memory_heap', 100 * 1024 * 1024),

[NoCoverage] ArrowFunction
engine-wrapper/src/health/health.controller.ts:26:7
     return this.health.check([
       async () => this.engine.checkReady('engine'),
       // The process should not use more than 100MB memory
-      async () => this.memory.checkHeap('memory_heap', 100 * 1024 * 1024),
+      () => undefined,
       // The process should not have more than 300MB allocated
       async () => this.memory.checkRSS('memory_rss', 300 * 1024 * 1024),

[NoCoverage] ArithmeticOperator
engine-wrapper/src/health/health.controller.ts:26:56
     return this.health.check([
       async () => this.engine.checkReady('engine'),
       // The process should not use more than 100MB memory
-      async () => this.memory.checkHeap('memory_heap', 100 * 1024 * 1024),
+      async () => this.memory.checkHeap('memory_heap', 100 / 1024 * 1024),
       // The process should not have more than 300MB allocated
       async () => this.memory.checkRSS('memory_rss', 300 * 1024 * 1024),

[NoCoverage] ArithmeticOperator
engine-wrapper/src/health/health.controller.ts:28:54
       // The process should not use more than 100MB memory
       async () => this.memory.checkHeap('memory_heap', 100 * 1024 * 1024),
       // The process should not have more than 300MB allocated
-      async () => this.memory.checkRSS('memory_rss', 300 * 1024 * 1024),
+      async () => this.memory.checkRSS('memory_rss', 300 * 1024 / 1024),
       // The used disk storage should not exceed 70% of the full disk size
       async () =>

[NoCoverage] ArithmeticOperator
engine-wrapper/src/health/health.controller.ts:28:54
       // The process should not use more than 100MB memory
       async () => this.memory.checkHeap('memory_heap', 100 * 1024 * 1024),
       // The process should not have more than 300MB allocated
-      async () => this.memory.checkRSS('memory_rss', 300 * 1024 * 1024),
+      async () => this.memory.checkRSS('memory_rss', 300 / 1024 * 1024),
       // The used disk storage should not exceed 70% of the full disk size
       async () =>

[NoCoverage] ArrowFunction
engine-wrapper/src/health/health.controller.ts:30:7
       // The process should not have more than 300MB allocated
       async () => this.memory.checkRSS('memory_rss', 300 * 1024 * 1024),
       // The used disk storage should not exceed 70% of the full disk size
-      async () =>
-        this.disk.checkStorage('disk', { thresholdPercent: 0.70, path: '/' }),
+      () => undefined,
     ]);
   }

[NoCoverage] StringLiteral
engine-wrapper/src/health/health.controller.ts:31:32
       async () => this.memory.checkRSS('memory_rss', 300 * 1024 * 1024),
       // The used disk storage should not exceed 70% of the full disk size
       async () =>
-        this.disk.checkStorage('disk', { thresholdPercent: 0.70, path: '/' }),
+        this.disk.checkStorage("", { thresholdPercent: 0.70, path: '/' }),
     ]);
   }

[NoCoverage] StringLiteral
engine-wrapper/src/health/health.controller.ts:31:72
       async () => this.memory.checkRSS('memory_rss', 300 * 1024 * 1024),
       // The used disk storage should not exceed 70% of the full disk size
       async () =>
-        this.disk.checkStorage('disk', { thresholdPercent: 0.70, path: '/' }),
+        this.disk.checkStorage('disk', { thresholdPercent: 0.70, path: "" }),
     ]);
   }
