[Killed] BlockStatement
engine-wrapper/src/engine/engine.health.ts:16:65
     super();
   }
 
-  async checkReady(key: string): Promise<HealthIndicatorResult> {
-    return this.service
-      .ready()
-      .then(() => this.getStatus(key, true))
-      .catch((err) => {
-        const result = this.getStatus(key, false, err);
-        throw new HealthCheckError(err.message, result);
-      });
-  }
+  async checkReady(key: string): Promise<HealthIndicatorResult> {}
 }
 
killedBy: EngineHealthIndicator checkReady should return success when engine is ready
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Timeout] BooleanLiteral
engine-wrapper/src/engine/engine.health.ts:19:39
   async checkReady(key: string): Promise<HealthIndicatorResult> {
     return this.service
       .ready()
-      .then(() => this.getStatus(key, true))
+      .then(() => this.getStatus(key, false))
       .catch((err) => {
         const result = this.getStatus(key, false, err);

[Timeout] ArrowFunction
engine-wrapper/src/engine/engine.health.ts:19:13
   async checkReady(key: string): Promise<HealthIndicatorResult> {
     return this.service
       .ready()
-      .then(() => this.getStatus(key, true))
+      .then(() => undefined)
       .catch((err) => {
         const result = this.getStatus(key, false, err);

[Timeout] BlockStatement
engine-wrapper/src/engine/engine.health.ts:20:23
     return this.service
       .ready()
       .then(() => this.getStatus(key, true))
-      .catch((err) => {
-        const result = this.getStatus(key, false, err);
-        throw new HealthCheckError(err.message, result);
-      });
+      .catch((err) => {});
   }
 }

[Survived] BooleanLiteral
engine-wrapper/src/engine/engine.health.ts:21:44
       .ready()
       .then(() => this.getStatus(key, true))
       .catch((err) => {
-        const result = this.getStatus(key, false, err);
+        const result = this.getStatus(key, true, err);
         throw new HealthCheckError(err.message, result);
       });
