[Killed] BlockStatement
engine-wrapper/src/engine/engine.service.ts:40:59
    * @return {*}  {Promise<SearchResult>} bestmove and info from engine
    * @memberof EngineService
    */
-  async move(options: MoveOptions): Promise<SearchResult> {
-    return this.engine
-      .chain()
-      .ucinewgame()
-      .position(options.position, options.moves)
-      .go({ movetime: options.movetime });
-  }
+  async move(options: MoveOptions): Promise<SearchResult> {}
 
   /**
killedBy: EngineService move should return a search result if success
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "position", ["history"]

Number of calls: 0

[Killed] ObjectLiteral
engine-wrapper/src/engine/engine.service.ts:45:11
       .chain()
       .ucinewgame()
       .position(options.position, options.moves)
-      .go({ movetime: options.movetime });
+      .go({});
   }
 
killedBy: EngineService move should return a search result if success
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

- Object {
-   "movetime": 5000,
- }

[Killed] BlockStatement
engine-wrapper/src/engine/engine.service.ts:61:34
    * @return {*}  {Promise<Engine>}
    * @memberof EngineService
    */
-  async ready(): Promise<Engine> {
-    return await this.engine.isready();
-  }
+  async ready(): Promise<Engine> {}
 }
 
killedBy: EngineService ready should return success when engine is ready
statusReason: Error: expect(received).resolves.toEqual(expected) // deep equality

Expected: {"chain": [Function mockConstructor], "isready": [Function mockConstructor]}
Received: undefined
